tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf26j13_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF26J13_H_
#define _PIC18LF26J13_H_

#define ADCTRIG                       0
#define TRIGSEL                       1
#define SRC                           2
#define TRIGSEL0                      3
#define SRC0                          4
#define TRIGSEL1                      5
#define SRC1                          6
#define PMDIS0                        7
#define PMDADC                        8
#define ADCMD                         9
#define SPI1MD                        10
#define PMDMSSP                       11
#define PMDMSSP1                      12
#define SPIMD                         13
#define SPI2MD                        14
#define PMDMSSP2                      15
#define PMDUART                       16
#define PMDUART1                      17
#define UARTMD                        18
#define UART1MD                       19
#define PMDUART2                      20
#define UART2MD                       21
#define PMDECCP                       22
#define ECCP1MD                       23
#define ECCPMD                        24
#define PMDECCP1                      25
#define ECCP2MD                       26
#define PMDECCP2                      27
#define ECCP3MD                       28
#define PMDECCP3                      29
#define PMDIS1                        30
#define PMDTMR                        31
#define TMRMD                         32
#define PMDTMR1                       33
#define TMR1MD                        34
#define PMDTMR2                       35
#define TMR2MD                        36
#define PMDTMR3                       37
#define TMR3MD                        38
#define PMDTMR4                       39
#define TMR4MD                        40
#define PMDRTCC                       41
#define RTCCMD                        42
#define CTMUMD                        43
#define PMDCTMU                       44
#define PMDIS2                        45
#define CMP1MD                        46
#define PMDCMP                        47
#define CMPMD                         48
#define PMDCMP1                       49
#define PMDCMP2                       50
#define CMP2MD                        51
#define CMP3MD                        52
#define PMDCMP3                       53
#define PMDTMR5                       54
#define TMR5MD                        55
#define TMR6MD                        56
#define PMDTMR6                       57
#define PMDTMR8                       58
#define TMR8MD                        59
#define PMDIS3                        60
#define CCP4MD                        61
#define PMDCCP                        62
#define PMDCCP4                       63
#define CCPMD                         64
#define PMDCCP5                       65
#define CCP5MD                        66
#define CCP6MD                        67
#define PMDCCP6                       68
#define CCP7MD                        69
#define PMDCCP7                       70
#define CCP8MD                        71
#define PMDCCP8                       72
#define PMDCCP9                       73
#define CCP9MD                        74
#define PMDCCP10                      75
#define CCP10MD                       76
#define PPSCON                        77
#define IOLOCK                        78
#define CCP10CON                      79
#define CCP10M                        80
#define CCP10M0                       81
#define CCP10M1                       82
#define CCP10M2                       83
#define CCP10M3                       84
#define DC10B0                        85
#define DC10B                         86
#define DC10B1                        87
#define CCPR10L                       88
#define CCPR10H                       89
#define CCP9CON                       90
#define CCP9M0                        91
#define CCP9M                         92
#define CCP9M1                        93
#define CCP9M2                        94
#define CCP9M3                        95
#define DC9B0                         96
#define DC9B                          97
#define DC9B1                         98
#define CCPR9L                        99
#define CCPR9H                        100
#define CCP8CON                       101
#define CCP8M0                        102
#define CCP8M                         103
#define CCP8M1                        104
#define CCP8M2                        105
#define CCP8M3                        106
#define DC8B0                         107
#define DC8B                          108
#define DC8B1                         109
#define CCPR8L                        110
#define CCPR8H                        111
#define CCP7CON                       112
#define CCP7M0                        113
#define CCP7M                         114
#define CCP7M1                        115
#define CCP7M2                        116
#define CCP7M3                        117
#define DC7B                          118
#define DC7B0                         119
#define DC7B1                         120
#define CCPR7L                        121
#define CCPR7H                        122
#define CCP6CON                       123
#define CCP6M                         124
#define CCP6M0                        125
#define CCP6M1                        126
#define CCP6M2                        127
#define CCP6M3                        128
#define DC6B0                         129
#define DC6B                          130
#define DC6B1                         131
#define CCPR6L                        132
#define CCPR6H                        133
#define CCP5CON                       134
#define CCP5M0                        135
#define CCP5M                         136
#define CCP5M1                        137
#define CCP5M2                        138
#define CCP5M3                        139
#define DC5B0                         140
#define DC5B                          141
#define DC5B1                         142
#define CCPR5L                        143
#define CCPR5H                        144
#define CCP4CON                       145
#define CCP4M                         146
#define CCP4M0                        147
#define CCP4M1                        148
#define CCP4M2                        149
#define CCP4M3                        150
#define DC4B0                         151
#define DC4B                          152
#define DC4B1                         153
#define CCPR4L                        154
#define CCPR4H                        155
#define CCP3CON                       156
#define CCP3M                         157
#define CCP3M0                        158
#define CCP3M1                        159
#define CCP3M2                        160
#define CCP3M3                        161
#define DC3B                          162
#define DC3B0                         163
#define DC3B1                         164
#define P3M                           165
#define P3M0                          166
#define P3M1                          167
#define CCPR3L                        168
#define CCPR3H                        169
#define ECCP3DEL                      170
#define P3DC                          171
#define P3DC0                         172
#define P3DC1                         173
#define P3DC2                         174
#define P3DC3                         175
#define P3DC4                         176
#define P3DC5                         177
#define P3DC6                         178
#define P3RSEN                        179
#define PSS3BD0                       180
#define PSS3BD                        181
#define PSS3BD1                       182
#define PSS3AC0                       183
#define PSS3AC                        184
#define PSS3AC1                       185
#define ECCP3AS                       186
#define ECCP3AS0                      187
#define ECCP3AS1                      188
#define ECCP3AS2                      189
#define ECCP3ASE                      190
#define PSTR3CON                      191
#define PSTR3CON_STRA                 192
#define STRA3                         193
#define STRB3                         194
#define PSTR3CON_STRB                 195
#define PSTR3CON_STRC                 196
#define STRC3                         197
#define STRD3                         198
#define PSTR3CON_STRD                 199
#define STRSYNC3                      200
#define PSTR3CON_STRSYNC              201
#define CMPL                          202
#define PSTR3CON_CMPL0                203
#define CMPL03                        204
#define CMPL13                        205
#define PSTR3CON_CMPL1                206
#define T8CON                         207
#define T8CKPS0                       208
#define T8CKPS                        209
#define T8CKPS1                       210
#define TMR8ON                        211
#define T8OUTPS                       212
#define T8OUTPS0                      213
#define T8OUTPS1                      214
#define T8OUTPS2                      215
#define T8OUTPS3                      216
#define PR8                           217
#define TMR8                          218
#define T6CON                         219
#define T6CKPS0                       220
#define T6CKPS                        221
#define T6CKPS1                       222
#define TMR6ON                        223
#define T6OUTPS0                      224
#define T6OUTPS                       225
#define T6OUTPS1                      226
#define T6OUTPS2                      227
#define T6OUTPS3                      228
#define PR6                           229
#define TMR6                          230
#define T5GCON                        231
#define T5GSS                         232
#define T5GSS0                        233
#define T5GSS1                        234
#define T5GVAL                        235
#define T5DONE                        236
#define T5GGO_NOT_T5DONE              237
#define nT5DONE                       238
#define T5GGO_nT5DONE                 239
#define NOT_T5DONE                    240
#define T5GGO                         241
#define T5GSPM                        242
#define T5GTM                         243
#define T5GPOL                        244
#define TMR5GE                        245
#define T5CON                         246
#define TMR5ON                        247
#define T5CON_RD16                    248
#define RD165                         249
#define nT5SYNC                       250
#define NOT_T5SYNC                    251
#define SOSCEN5                       252
#define T5OSCEN                       253
#define T5CKPS                        254
#define T5CKPS0                       255
#define T5CKPS1                       256
#define TMR5CS0                       257
#define TMR5CS                        258
#define TMR5CS1                       259
#define TMR5L                         260
#define TMR5H                         261
#define CM3CON                        262
#define CM3CON_CCH                    263
#define CCH03                         264
#define CM3CON_CCH0                   265
#define CCH13                         266
#define CM3CON_CCH1                   267
#define CM3CON_CREF                   268
#define CREF3                         269
#define CM3CON_EVPOL                  270
#define EVPOL03                       271
#define CM3CON_EVPOL0                 272
#define CM3CON_EVPOL1                 273
#define EVPOL13                       274
#define CM3CON_CPOL                   275
#define CPOL3                         276
#define COE3                          277
#define CM3CON_COE                    278
#define CM3CON_CON                    279
#define CON3                          280
#define RTCVALL                       281
#define WAITE0                        282
#define RTCVALH                       283
#define WAITE1                        284
#define WAITM0                        285
#define WAITM1                        286
#define WAITM2                        287
#define WAITM3                        288
#define WAITB0                        289
#define WAITB1                        290
#define PADCFG1                       291
#define RTSECSEL0                     292
#define RTSECSEL1                     293
#define REFOCON                       294
#define RODIV0                        295
#define RODIV                         296
#define RODIV1                        297
#define RODIV2                        298
#define RODIV3                        299
#define ROSEL                         300
#define ROSSLP                        301
#define ROON                          302
#define RTCCAL                        303
#define CAL0                          304
#define CAL                           305
#define CAL1                          306
#define CAL2                          307
#define CAL3                          308
#define CAL4                          309
#define CAL5                          310
#define CAL6                          311
#define CAL7                          312
#define RTCCFG                        313
#define RTCPTR0                       314
#define RTCPTR1                       315
#define RTCOE                         316
#define HALFSEC                       317
#define RTCSYNC                       318
#define RTCWREN                       319
#define RTCEN                         320
#define ODCON3                        321
#define SPI1OD                        322
#define SPI2OD                        323
#define CTMUDS                        324
#define ODCON2                        325
#define U1OD                          326
#define U2OD                          327
#define CCP9OD                        328
#define CCP10OD                       329
#define ODCON1                        330
#define ECCP1OD                       331
#define ECCP2OD                       332
#define ECCP3OD                       333
#define CCP4OD                        334
#define CCP5OD                        335
#define CCP6OD                        336
#define CCP7OD                        337
#define CCP8OD                        338
#define ALRMVALL                      339
#define ALRMVALH                      340
#define ALRMRPT                       341
#define ARPT0                         342
#define ARPT                          343
#define ARPT1                         344
#define ARPT2                         345
#define ARPT3                         346
#define ARPT4                         347
#define ARPT5                         348
#define ARPT6                         349
#define ARPT7                         350
#define ALRMCFG                       351
#define ALRMPTR                       352
#define ALRMPTR0                      353
#define ALRMPTR1                      354
#define AMASK0                        355
#define AMASK                         356
#define AMASK1                        357
#define AMASK2                        358
#define AMASK3                        359
#define CHIME                         360
#define ALRMEN                        361
#define ANCON0                        362
#define PCFG0                         363
#define PCFG1                         364
#define PCFG2                         365
#define PCFG3                         366
#define PCFG4                         367
#define ANCON1                        368
#define PCFG8                         369
#define PCFG9                         370
#define PCFG10                        371
#define PCFG11                        372
#define PCFG12                        373
#define PCFG15                        374
#define VBGEN                         375
#define DSWAKEL                       376
#define DSPOR                         377
#define DSMCLR                        378
#define DSRTC                         379
#define DSWDT                         380
#define DSULP                         381
#define DSFLT                         382
#define DSWAKEH                       383
#define DSINT0                        384
#define DSCONL                        385
#define RELEASE                       386
#define DSBOR                         387
#define ULPWDIS                       388
#define DSCONH                        389
#define RTCWDIS                       390
#define DSULPEN                       391
#define DSEN                          392
#define DSGPR0                        393
#define DSGPR1                        394
#define CCPTMRS2                      395
#define C8TSEL0                       396
#define C8TSEL                        397
#define C8TSEL1                       398
#define C9TSEL0                       399
#define C10TSEL0                      400
#define CCPTMRS1                      401
#define C4TSEL                        402
#define C4TSEL0                       403
#define C4TSEL1                       404
#define C5TSEL0                       405
#define C6TSEL0                       406
#define C7TSEL                        407
#define C7TSEL0                       408
#define C7TSEL1                       409
#define CCPTMRS0                      410
#define C1TSEL0                       411
#define C1TSEL                        412
#define C1TSEL1                       413
#define C1TSEL2                       414
#define C2TSEL0                       415
#define C2TSEL                        416
#define C2TSEL1                       417
#define C2TSEL2                       418
#define C3TSEL0                       419
#define C3TSEL                        420
#define C3TSEL1                       421
#define CVRCON                        422
#define CVR                           423
#define CVR0                          424
#define CVR1                          425
#define CVR2                          426
#define CVR3                          427
#define CVRSS                         428
#define CVRR                          429
#define CVROEN                        430
#define CVROE                         431
#define CVREN                         432
#define DMABCH                        433
#define DMACNTHB                      434
#define DMABCL                        435
#define DMACNTLB                      436
#define RXADDRH                       437
#define DMARCVPTRHB                   438
#define RXADDRL                       439
#define DMARCVPTRLB                   440
#define TXADDRH                       441
#define DMATXPTRHB                    442
#define TXADDRL                       443
#define DMATXPTRLB                    444
#define CMSTAT                        445
#define COUT1                         446
#define COUT2                         447
#define COUT3                         448
#define SSP2CON2                      449
#define SEN2                          450
#define SSP2CON2_SEN                  451
#define ADMSK12                       452
#define SSP2CON2_RSEN                 453
#define RSEN2                         454
#define SSP2CON2_ADMSK1               455
#define ADMSK22                       456
#define PEN2                          457
#define SSP2CON2_PEN                  458
#define SSP2CON2_ADMSK2               459
#define ADMSK32                       460
#define SSP2CON2_RCEN                 461
#define RCEN2                         462
#define SSP2CON2_ADMSK3               463
#define ACKEN2                        464
#define ADMSK42                       465
#define SSP2CON2_ADMSK4               466
#define SSP2CON2_ACKEN                467
#define ACKDT2                        468
#define ADMSK52                       469
#define SSP2CON2_ACKDT                470
#define SSP2CON2_ADMSK5               471
#define SSP2CON2_ACKSTAT              472
#define ACKSTAT2                      473
#define SSP2CON2_GCEN                 474
#define GCEN2                         475
#define SSP2CON1                      476
#define SSP2CON1_SSPM                 477
#define SSP2CON1_SSPM0                478
#define SSPM02                        479
#define SSPM12                        480
#define SSP2CON1_SSPM1                481
#define SSP2CON1_SSPM2                482
#define SSPM22                        483
#define SSPM32                        484
#define SSP2CON1_SSPM3                485
#define SSP2CON1_CKP                  486
#define CKP2                          487
#define SSPEN2                        488
#define SSP2CON1_SSPEN                489
#define SSPOV2                        490
#define SSP2CON1_SSPOV                491
#define WCOL2                         492
#define SSP2CON1_WCOL                 493
#define SSP2STAT                      494
#define SSP2STAT_BF                   495
#define BF2                           496
#define SSP2STAT_UA                   497
#define UA2                           498
#define RW2                           499
#define READ_WRITE2                   500
#define nW2                           501
#define I2C_READ2                     502
#define SSP2STAT_R_NOT_W              503
#define R_nW2                         504
#define nWRITE2                       505
#define R_W2                          506
#define SSP2STAT_R_nW                 507
#define SSP2STAT_S                    508
#define S2                            509
#define START2                        510
#define I2C_START2                    511
#define P2                            512
#define SSP2STAT_P                    513
#define STOP2                         514
#define I2C_STOP2                     515
#define I2C_DAT2                      516
#define DATA_ADDRESS2                 517
#define SSP2STAT_D_NOT_A              518
#define D_A2                          519
#define SSP2STAT_D_nA                 520
#define nA2                           521
