tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf26j13_tdd.h
#define DA2                           522
#define nADDRESS2                     523
#define D_nA2                         524
#define SSP2STAT_CKE                  525
#define CKE2                          526
#define SSP2STAT_SMP                  527
#define SMP2                          528
#define SSP2ADD                       529
#define MSK02                         530
#define SSP2ADD_SSPADD                531
#define MSK12                         532
#define MSK22                         533
#define MSK32                         534
#define MSK42                         535
#define MSK52                         536
#define MSK62                         537
#define MSK72                         538
#define SSP2MSK                       539
#define SSP2MSK_MSK0                  540
#define SSP2MSK_MSK1                  541
#define SSP2MSK_MSK2                  542
#define SSP2MSK_MSK3                  543
#define SSP2MSK_MSK4                  544
#define SSP2MSK_MSK5                  545
#define SSP2MSK_MSK6                  546
#define SSP2MSK_MSK7                  547
#define SSP2BUF                       548
#define SSP2BUF_SSPBUF                549
#define T4CON                         550
#define T4CKPS0                       551
#define T4CKPS                        552
#define T4CKPS1                       553
#define TMR4ON                        554
#define T4OUTPS                       555
#define T4OUTPS0                      556
#define T4OUTPS1                      557
#define T4OUTPS2                      558
#define T4OUTPS3                      559
#define PR4                           560
#define TMR4                          561
#define T3CON                         562
#define TMR3ON                        563
#define T3CON_RD16                    564
#define nT3SYNC                       565
#define NOT_T3SYNC                    566
#define SOSCEN3                       567
#define T3OSCEN                       568
#define T3CKPS                        569
#define T3CKPS0                       570
#define T3CKPS1                       571
#define TMR3CS0                       572
#define TMR3CS                        573
#define TMR3CS1                       574
#define T3RD16                        575
#define RD163                         576
#define TMR3L                         577
#define TMR3H                         578
#define BAUDCON2                      579
#define ABDEN2                        580
#define BAUDCON2_ABDEN                581
#define WUE2                          582
#define BAUDCON2_WUE                  583
#define BRG162                        584
#define BAUDCON2_BRG16                585
#define SCKP2                         586
#define TXCKP2                        587
#define BAUDCON2_TXCKP                588
#define DTRXP2                        589
#define RXDTP2                        590
#define BAUDCON2_RXDTP                591
#define RCMT2                         592
#define RCIDL2                        593
#define BAUDCON2_RCIDL                594
#define BAUDCON2_ABDOVF               595
#define ABDOVF2                       596
#define SPBRGH2                       597
#define BAUDCON1                      598
#define BAUDCON1_ABDEN                599
#define ABDEN1                        600
#define BAUDCON1_WUE                  601
#define WUE1                          602
#define W4E                           603
#define BRG161                        604
#define BAUDCON1_BRG16                605
#define CKTXP                         606
#define BAUDCON1_TXCKP                607
#define SCKP1                         608
#define TXCKP1                        609
#define SCKP                          610
#define DTRXP1                        611
#define RXDTP1                        612
#define DTRXP                         613
#define RXCKP                         614
#define BAUDCON1_RXDTP                615
#define RCMT1                         616
#define RCIDL1                        617
#define BAUDCON1_RCIDL                618
#define RCMT                          619
#define ABDOVF1                       620
#define BAUDCON1_ABDOVF               621
#define SPBRGH1                       622
#define PORTA                         623
#define C1INA                         624
#define AN0                           625
#define ULPWUIN                       626
#define ULPWU                         627
#define RP0                           628
#define RA0                           629
#define VBG                           630
#define AN1                           631
#define RP1                           632
#define RA1                           633
#define C2INA                         634
#define C1IND                         635
#define AN2                           636
#define C3INB                         637
#define CVREF                         638
#define RA2                           639
#define VREF_MINUS                    640
#define C2INB                         641
#define C1INB                         642
#define AN3                           643
#define VREF_PLUS                     644
#define RA3                           645
#define AN4                           646
#define C1INC                         647
#define NOT_SS1                       648
#define RP2                           649
#define LVDIN                         650
#define RA5                           651
#define nSS1                          652
#define HLVDIN                        653
#define CLKO                          654
#define RA6                           655
#define OSC2                          656
#define CLKI                          657
#define RJPU                          658
#define RA7                           659
#define OSC1                          660
#define PORTB                         661
#define RB0                           662
#define C3IND                         663
#define INT0                          664
#define RP3                           665
#define AN12                          666
#define RB1                           667
#define C3INC                         668
#define RP4                           669
#define RTCC                          670
#define AN10                          671
#define REFO                          672
#define AN8                           673
#define RB2                           674
#define C2INC                         675
#define RP5                           676
#define CTED1                         677
#define AN9                           678
#define RB3                           679
#define C3INA                         680
#define CCP2_PA2                      681
#define RP6                           682
#define CTED2                         683
#define CCP4                          684
#define RB4                           685
#define RP7                           686
#define SCL2                          687
#define KBI0                          688
#define CCP5                          689
#define RB5                           690
#define RP8                           691
#define KBI1                          692
#define SDA2                          693
#define CCP6                          694
#define PGC                           695
#define RB6                           696
#define RP9                           697
#define KBI2                          698
#define CCP7                          699
#define PGD                           700
#define RB7                           701
#define RP10                          702
#define KBI3                          703
#define PORTC                         704
#define T1CKI                         705
#define RP11                          706
#define T1OSO                         707
#define RC0                           708
#define CCP8                          709
#define CCP2                          710
#define RP12                          711
#define T1OSI                         712
#define PA2                           713
#define RC1                           714
#define RP13                          715
#define CTPLS                         716
#define PA1                           717
#define RC2                           718
#define C2IND                         719
#define AN11                          720
#define SCK1                          721
#define RP14                          722
#define SCL1                          723
#define RC3                           724
#define RP15                          725
#define SDI1                          726
#define SDA1                          727
#define RC4                           728
#define SDO1                          729
#define RP16                          730
#define RC5                           731
#define CCP9                          732
#define RP17                          733
#define TX1                           734
#define RC6                           735
#define CK1                           736
#define CCP10                         737
#define RP18                          738
#define RX1                           739
#define RC7                           740
#define DT1                           741
#define HLVDCON                       742
#define HLVDL                         743
#define HLVDL0                        744
#define HLVDL1                        745
#define HLVDL2                        746
#define HLVDL3                        747
#define HLVDEN                        748
#define IRVST                         749
#define BGVST                         750
#define VDIRMAG                       751
#define DMACON2                       752
#define INTLVL0                       753
#define INTLVL                        754
#define INTLVL1                       755
#define INTLVL2                       756
#define INTLVL3                       757
#define DLYCYC                        758
#define DLYCYC0                       759
#define DLYCYC1                       760
#define DLYCYC2                       761
#define DLYCYC3                       762
#define OSCCON2                       763
#define PRISD                         764
#define SOSCGO                        765
#define SOSCDRV                       766
#define SOSCRUN                       767
#define DMACON1                       768
#define DMAEN                         769
#define DLYINTEN                      770
#define DUPLEX0                       771
#define DUPLEX1                       772
#define RXINC                         773
#define TXINC                         774
#define SSCON0                        775
#define SSCON1                        776
#define LATA                          777
#define LATA0                         778
#define LA0                           779
#define LATA1                         780
#define LA1                           781
#define LATA2                         782
#define LA2                           783
#define LATA3                         784
#define LA3                           785
#define LATA5                         786
#define LA5                           787
#define LATA6                         788
#define LA6                           789
#define LATA7                         790
#define LA7                           791
#define LATB                          792
#define LB0                           793
#define LATB0                         794
#define LB1                           795
#define LATB1                         796
#define LB2                           797
#define LATB2                         798
#define LB3                           799
#define LATB3                         800
#define LB4                           801
#define LATB4                         802
#define LB5                           803
#define LATB5                         804
#define LB6                           805
#define LATB6                         806
#define LB7                           807
#define LATB7                         808
#define LATC                          809
#define LATC0                         810
#define LC0                           811
#define LATC1                         812
#define LC1                           813
#define LATC2                         814
#define LC2                           815
#define LATC3                         816
#define LC3                           817
#define LATC4                         818
#define LC4                           819
#define LATC5                         820
#define LC5                           821
#define LATC6                         822
#define LC6                           823
#define LATC7                         824
#define LC7                           825
#define PIE4                          826
#define CCP3IE                        827
#define CCP4IE                        828
#define CCP5IE                        829
#define CCP6IE                        830
#define CCP7IE                        831
#define CCP8IE                        832
#define CCP9IE                        833
#define CCP10IE                       834
#define PIR4                          835
#define CCP3IF                        836
#define CCP4IF                        837
#define CCP5IF                        838
#define CCP6IF                        839
#define CCP7IF                        840
#define CCP8IF                        841
#define CCP9IF                        842
#define CCP10IF                       843
#define IPR4                          844
#define CCP3IP                        845
#define CCIP3IP                       846
#define CCP4IP                        847
#define CCP5IP                        848
#define CCP6IP                        849
#define CCP7IP                        850
#define CCP8IP                        851
#define CCP9IP                        852
#define CCP10IP                       853
#define PIE5                          854
#define TMR1GIE                       855
#define TMR5GIE                       856
#define TMR5IE                        857
#define TMR6IE                        858
#define TMR8IE                        859
#define CM3IE                         860
#define TRISA                         861
#define TRISA0                        862
#define TRISA1                        863
#define TRISA2                        864
#define TRISA3                        865
#define TRISA5                        866
#define TRISA6                        867
#define TRISA7                        868
#define TRISB                         869
#define TRISB0                        870
#define TRISB1                        871
#define TRISB2                        872
#define TRISB3                        873
#define TRISB4                        874
#define TRISB5                        875
#define TRISB6                        876
#define TRISB7                        877
#define TRISC                         878
#define TRISC0                        879
#define TRISC1                        880
#define TRISC2                        881
#define TRISC3                        882
#define TRISC4                        883
#define TRISC5                        884
#define TRISC6                        885
#define TRISC7                        886
#define T3GCON                        887
#define T3GSS0                        888
#define T3GSS1                        889
#define T3GVAL                        890
#define T3GGO                         891
#define T3DONE                        892
#define T3GGO_T3DONE                  893
#define T3GSPM                        894
#define T3GTM                         895
#define T3GPOL                        896
#define TMR3GE                        897
#define PIR5                          898
#define TMR1GIF                       899
#define TMR5GIF                       900
#define TMR5IF                        901
#define TMR6IF                        902
#define TMR8IF                        903
#define CM3IF                         904
#define IPR5                          905
#define CCH05                         906
#define TMR1GIP                       907
#define TMR5GIP                       908
#define CCH15                         909
#define TMR5IP                        910
#define EVPOL05                       911
#define TMR6IP                        912
#define EVPOL15                       913
#define TMR8IP                        914
#define CM3IP                         915
#define T1GCON                        916
#define T1GSS0                        917
#define T1GSS1                        918
#define T1GVAL                        919
#define T1GGO_nT1DONE                 920
#define T1DONE                        921
#define nT1DONE                       922
#define T1GGO_NOT_T1DONE              923
#define NOT_T1DONE                    924
#define T1GGO                         925
#define T1GSPM                        926
#define T1GTM                         927
#define T1GPOL                        928
#define TMR1GE                        929
#define OSCTUNE                       930
#define TUN0                          931
#define TUN                           932
#define TUN1                          933
#define TUN2                          934
#define TUN3                          935
#define TUN4                          936
#define TUN5                          937
#define PLLEN                         938
#define INTSRC                        939
#define RCSTA2                        940
#define RCD82                         941
#define RX9D2                         942
#define RCSTA2_RX9D                   943
#define OERR2                         944
#define RCSTA2_OERR                   945
#define FERR2                         946
#define RCSTA2_FERR                   947
#define ADDEN2                        948
#define RCSTA2_ADDEN                  949
#define RCSTA2_CREN                   950
#define CREN2                         951
#define SREN2                         952
#define RCSTA2_SREN                   953
#define RC92                          954
#define RC8_92                        955
#define RCSTA2_RX9                    956
#define RX92                          957
#define RCSTA2_SPEN                   958
#define SPEN2                         959
#define PIE1                          960
#define TMR1IE                        961
#define TMR2IE                        962
#define CCP1IE                        963
#define SSP1IE                        964
#define SSPIE                         965
#define TXIE                          966
#define TX1IE                         967
#define RC1IE                         968
#define RCIE                          969
#define ADIE                          970
#define PIR1                          971
#define TMR1IF                        972
#define TMR2IF                        973
#define CCP1IF                        974
#define SSPIF                         975
#define SSP1IF                        976
#define TXIF                          977
#define TX1IF                         978
#define RCIF                          979
#define RC1IF                         980
#define ADIF                          981
#define IPR1                          982
#define TMR1IP                        983
#define TMR2IP                        984
#define CCP1IP                        985
#define SSPIP                         986
#define SSP1IP                        987
#define TX1IP                         988
#define TXIP                          989
#define RCIP                          990
#define RC1IP                         991
#define ADIP                          992
#define PIE2                          993
#define CCP2IE                        994
#define TMR3IE                        995
#define HLVDIE                        996
#define LVDIE                         997
#define BCL1IE                        998
#define BCLIE                         999
#define CM1IE                         1000
#define CMIE                          1001
#define CM2IE                         1002
#define OSCFIE                        1003
#define PIR2                          1004
#define CCP2IF                        1005
#define TMR3IF                        1006
#define HLVDIF                        1007
#define LVDIF                         1008
#define BCL1IF                        1009
#define BCLIF                         1010
#define CM1IF                         1011
#define CMIF                          1012
#define CM2IF                         1013
#define OSCFIF                        1014
#define IPR2                          1015
#define CCP2IP                        1016
#define TMR3IP                        1017
#define HLVDIP                        1018
#define LVDIP                         1019
#define BCLIP                         1020
#define BCL1IP                        1021
#define CM1IP                         1022
#define CM2IP                         1023
#define CMIP                          1024
#define OSCFIP                        1025
#define PIE3                          1026
#define RTCCIE                        1027
#define RXB0IE                        1028
#define RXBNIE                        1029
#define TMR3GIE                       1030
#define RXB1IE                        1031
#define CTMUIE                        1032
#define TXB0IE                        1033
#define TMR4IE                        1034
#define TXB1IE                        1035
#define TXB2IE                        1036
#define TXBNIE                        1037
#define TX2IE                         1038
#define RC2IE                         1039
#define BCL2IE                        1040
#define SSP2IE                        1041
#define PIR3                          1042
#define RTCCIF                        1043
#define RXBNIF                        1044
#define TMR3GIF                       1045
#define CTMUIF                        1046
#define TMR4IF                        1047
#define TXBNIF                        1048
#define TX2IF                         1049
#define RC2IF                         1050
#define BCL2IF                        1051
#define SSP2IF                        1052
#define IPR3                          1053
#define RTCCIP                        1054
#define TMR3GIP                       1055
#define RXBNIP                        1056
#define CTMUIP                        1057
#define TMR4IP                        1058
#define TX2IP                         1059
#define TXBNIP                        1060
#define RC2IP                         1061
#define BCL2IP                        1062
#define SSP2IP                        1063
#define EECON1                        1064
#define WR                            1065
#define WREN                          1066
#define WRERR                         1067
#define FREE                          1068
#define WPROG                         1069
#define EECON2                        1070
#define TXSTA2                        1071
#define TX9D2                         1072
#define TXSTA2_TX9D                   1073
#define TXD82                         1074
#define TRMT2                         1075
#define TXSTA2_TRMT                   1076
#define BRGH2                         1077
#define TXSTA2_BRGH                   1078
#define SENDB2                        1079
#define TXSTA2_SENDB                  1080
#define TXSTA2_SYNC                   1081
#define SYNC2                         1082
#define TXEN2                         1083
#define TXSTA2_TXEN                   1084
#define TX8_92                        1085
#define TX92                          1086
#define TXSTA2_TX9                    1087
#define TXSTA2_CSRC                   1088
#define CSRC2                         1089
#define TXREG2                        1090
